rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas' ORDER BY release_date
---
  def discover
    @movie = Movie.find params[:id]
    if @movie.director == nil || @movie.director == ''
      flash[:notice] = "Movie '#{@movie.title}' does not have a director."
      redirect_to movies_path
    else
      @movies = Movie.find_all_by_director(@movie.director, {:order => :release_date})